{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim"
    },
    "FixCursorHold.nvim": {
      "src": "https://github.com/antoinemadec/FixCursorHold.nvim"
    },
    "LuaSnip": [],
    "aerial.nvim": {
      "src": "https://github.com/stevearc/aerial.nvim"
    },
    "bufferline.nvim": [],
    "crates.nvim": [],
    "fidget.nvim": {
      "version": "'main'"
    },
    "lualine.nvim": {
    },
    "mason-lspconfig.nvim": [],
    "mason-tool-installer.nvim": [],
    "mason.nvim": [],
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons"
    },
    "mini.move": {
      "src": "https://github.com/nvim-mini/mini.move"
    },
    "mini.pairs": {
      "src": "https://github.com/nvim-mini/mini.pairs"
    },
    "neotest": {
      "src": "https://github.com/nvim-neotest/neotest"
    },
    "none-ls-shellcheck.nvim": [],
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-lspconfig": {
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-tree.lua": [],
    "nvim-treesitter": {
      "version": "'main'"
    },
    "nvim-web-devicons": [],
    "plenary.nvim": [],
    "rustaceanvim": [],
    "snacks.nvim": [],
    "toggleterm.nvim": [],
    "vscode.nvim": [],
    "which-key.nvim": []
  }
}